app/controllers/users_controller.rb

  def index
    @users = User.find(:all)
    p "ok"

   p User.find_with_ferret '11',:limit=>:all
---
SELECT * FROM `users` WHERE (users.id in ('4'))
SELECT * FROM `users`

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`name`, `updated_at`, `age`, `created_at`) VALUES('eee', '2010-01-19 01:29:17', 12, '2010-01-19 01:29:17')

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM `users` WHERE (`users`.`id` = 2)
UPDATE `users` SET `age` = 11243, `name` = '谔谔4 ' WHERE `id` = 2

  def search
    q=params[:q]
    if q
       @users=Array.new
       @users=User.find_with_ferret q,:limit=>:all
---
SELECT * FROM `users` WHERE (users.id in ('1'))